# Time Series 활용

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

def prt(*pVPK) :
    print(*pVPK, sep = '\n', end = '\n')

class disp(object):
    template = '<div style="float: left;padding:10px;"> <b>[{0}]</b> {1}</div>'
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join( self.template.format(a, eval(a)._repr_html_()) 
                        for a in self.args)
    
import pandas as pd
import numpy as np 
from datetime import datetime, timedelta, date,time
import calendar

### [예제1] Time Series Indexing 1

In [2]:
# [1]

idx = pd.to_datetime(['2000-1-1','2000-1-5','2000-2-13','2000-2-20'])
df = pd.DataFrame({'name':list('ABCD'), 'sale':[10,5,20,30]}, index=idx)

sr = df['name']
r1 = sr['2000-1-1']
r2 = sr[ datetime(2000,1,1) ]
r3 = sr['2000-1-1':'2000-1-31']
r4 = sr[:2]
r5 = sr['2000-1']
df; r1; r2; r3; r4;r5

           name  sale
2000-01-01    A    10
2000-01-05    B     5
2000-02-13    C    20
2000-02-20    D    30

'A'

'A'

2000-01-01    A
2000-01-05    B
Name: name, dtype: object

2000-01-01    A
2000-01-05    B
Name: name, dtype: object

2000-01-01    A
2000-01-05    B
Name: name, dtype: object

In [3]:
# [2]

idx = pd.to_datetime(['2000-1-1','2000-1-5','2000-2-13','2000-2-20'])
df = pd.DataFrame({'name':list('ABCD'), 'sale':[10,5,20,30]}, index=idx)

r6 = df.loc[ pd.Timestamp('2000-1-1') ]
r7 = df.loc['2000-1-1']
r8 = df.loc['2000-1-1':'2000-1-31']
r9 = df.loc['2000-1']
r6; r7; disp('df', 'r8', 'r9')

name     A
sale    10
Name: 2000-01-01 00:00:00, dtype: object

name     A
sale    10
Name: 2000-01-01 00:00:00, dtype: object

In [4]:
# [3]

idx = pd.to_datetime(['2000-1-1','2000-1-5','2000-2-13','2000-2-20'])
df = pd.DataFrame({'name':list('ABCD'), 'sale':[10,5,20,30]}, index=idx)

r10 = df[df.index.day_name()=='Sunday']
r11 = df[ df.index.is_month_start ]

print(df.index.day_name())
disp('df', 'r10', 'r11')

Index(['Saturday', 'Wednesday', 'Sunday', 'Sunday'], dtype='object')

### [예제2] Time Series Indexing 관련 메서드

In [5]:
# [r1/r2]

idx = pd.to_datetime(['2000-1-1 5:30','2000-1-5 12:00','2000-2-13 7:00','2000-2-20 12:00'])
df = pd.DataFrame({'name':list('ABCD'), 'sale':[10,5,20,30]}, index=idx)

r1 = df.between_time('09:00','13:00')
r2 = df.at_time('12:00')
disp('df', 'r1', 'r2')

In [6]:
# [r3/r4/r5/r6]

idx = pd.to_datetime(['2000-1-1 5:30','2000-1-5 12:00','2000-2-13 7:00','2000-2-20 12:00'])
df = pd.DataFrame({'name':list('ABCD'), 'sale':[10,5,20,30]}, index=idx)

r3 = df.first('30D')
r4 = df.truncate(after='2000-2')
r5 = df.truncate(before='2000-1', after='2000-2')
r6 = df.last('30D')
df; disp('r3', 'r4', 'r5', 'r6')

                    name  sale
2000-01-01 05:30:00    A    10
2000-01-05 12:00:00    B     5
2000-02-13 07:00:00    C    20
2000-02-20 12:00:00    D    30

### [예제3] Time Series 집계

In [7]:
idx = pd.to_datetime(['2000-1-1','2000-1-5','2000-2-13','2000-2-20'])
df = pd.DataFrame({'cnt':[10,5,20,30]}, index=idx)

df['month'] = df.index.month
r1 = df['month'].value_counts()
r2 = df.groupby(lambda x:x.day_name())['cnt'].sum()
r3 = df.groupby(pd.Grouper(freq='M'))['cnt'].sum()
df; r1; r2; r3

            cnt  month
2000-01-01   10      1
2000-01-05    5      1
2000-02-13   20      2
2000-02-20   30      2

1    2
2    2
Name: month, dtype: int64

Saturday     10
Sunday       50
Wednesday     5
Name: cnt, dtype: int64

2000-01-31    15
2000-02-29    50
Freq: M, Name: cnt, dtype: int64

### [예제4] Time Series을 값으로 갖는 Series

In [8]:
# [1]

d = pd.to_datetime(['2000-1-1','2000-1-5','2000-2-13','2000-2-20'])
df = pd.DataFrame({'date':d, 'sale':[10,5,20,30]},index=list('ABCD'))

r1 = df[ df['date'].dt.day_name() == 'Sunday' ]
r2 = df[ df['date'].dt.month == 2 ]
r3 = df[ df['date'].dt.day.between(10, 20)]
disp('df', 'r1', 'r2', 'r3')
print(df['date'].dt.day_name())

A     Saturday
B    Wednesday
C       Sunday
D       Sunday
Name: date, dtype: object

In [9]:
# [2]

d = pd.to_datetime(['2000-1-1','2000-1-5','2000-2-13','2000-2-20'])
df = pd.DataFrame({'date':d, 'sale':[10,5,20,30]},index=list('ABCD'))

r4 = df['date'].diff()
r5 = df['date'] - df['date'].min()
r6 = r5 // pd.Timedelta(days=7)

print(r4.dtype, r5.dtype)
df; r4; r5; r6

timedelta64[ns] timedelta64[ns]

        date  sale
A 2000-01-01    10
B 2000-01-05     5
C 2000-02-13    20
D 2000-02-20    30

A       NaT
B    4 days
C   39 days
D    7 days
Name: date, dtype: timedelta64[ns]

A    0 days
B    4 days
C   43 days
D   50 days
Name: date, dtype: timedelta64[ns]

A    0
B    0
C    6
D    7
Name: date, dtype: int64

### [예제5] 시계열 데이터 이동(shift)

In [10]:
idx = pd.date_range('2021-1-2', periods=3)
sr = pd.Series(range(3), index=idx)
r1 = sr.shift(1)                  # value를 한개씩 밀고 NaN 처리
r2 = sr.shift(1, fill_value=0)  # NaN -> 0 처리 
r3 = sr.shift(5, freq='D')
sr; r1; r2; r3

2021-01-02    0
2021-01-03    1
2021-01-04    2
Freq: D, dtype: int64

2021-01-02    NaN
2021-01-03    0.0
2021-01-04    1.0
Freq: D, dtype: float64

2021-01-02    0
2021-01-03    0
2021-01-04    1
Freq: D, dtype: int64

2021-01-07    0
2021-01-08    1
2021-01-09    2
Freq: D, dtype: int64

### [예제6] asfreq() 메서드

In [11]:
print(calendar.month(2021,1))

idx = pd.date_range('2021-1-1', periods=3, freq='2D')
pi = pd.period_range('2020-01-01', '2022-01-01', freq='A')
sr = pd.Series(range(3), index=idx)
r1 = sr.asfreq(pd.offsets.BDay(1))
r2 = pi.asfreq('M', how='S')

prt(sr, r1)
prt(pi, r2)

    January 2021
Mo Tu We Th Fr Sa Su
             1  2  3
 4  5  6  7  8  9 10
11 12 13 14 15 16 17
18 19 20 21 22 23 24
25 26 27 28 29 30 31

2021-01-01    0
2021-01-03    1
2021-01-05    2
Freq: 2D, dtype: int64
2021-01-01    0.0
2021-01-04    NaN
2021-01-05    2.0
Freq: B, dtype: float64
PeriodIndex(['2020', '2021', '2022'], dtype='period[A-DEC]')
PeriodIndex(['2020-01', '2021-01', '2022-01'], dtype='period[M]')

### [예제7] resampling

In [12]:
# [1]

idx = pd.date_range('2021-1-1', periods=6, freq='D')
sr = pd.Series(range(1,7), index=idx)
r1 = sr.resample('3D').mean()
r2 = sr.resample('3D').ohlc()
r3 = sr.resample('3D').sum() # closed='left',label='left'
r4 = sr.resample('3D',closed='right',label='right').sum()
sr; r1; r2; r3; r4

2021-01-01    1
2021-01-02    2
2021-01-03    3
2021-01-04    4
2021-01-05    5
2021-01-06    6
Freq: D, dtype: int64

2021-01-01    2.0
2021-01-04    5.0
Freq: 3D, dtype: float64

            open  high  low  close
2021-01-01     1     3    1      3
2021-01-04     4     6    4      6

2021-01-01     6
2021-01-04    15
Freq: 3D, dtype: int64

2021-01-01     1
2021-01-04     9
2021-01-07    11
Freq: 3D, dtype: int64

In [ ]:
# [2] 

idx2 = pd.date_range('2021-1-1', periods=3, freq='2D')
sr2 = pd.Series(range(3), index=idx2)
r5 = sr2.resample('D').asfreq()
r6 = sr2.resample('D').ffill()
r7 = sr2.resample('D').apply(lambda x: sum(x)+5)
sr2; r5;r6;r7

In [ ]:
# [3]

idx3 = pd.date_range('2021-1-1', periods=24, freq='H')
sr3 = pd.Series(range(len(idx3)), index=idx3)
r8 = sr3.groupby(pd.Grouper(freq='9H')).size()

prt(sr3, r8)